sources/payloads/up.xml

<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'
    xmlns:schema='http://www.onvif.org/ver10/schema'
    xmlns:device='http://www.onvif.org/ver10/device/wsdl'
    xmlns:imaging='http://www.onvif.org/ver20/imaging/wsdl'
    xmlns:media='http://www.onvif.org/ver10/media/wsdl'
    xmlns:ptz='http://www.onvif.org/ver20/ptz/wsdl'
    xmlns:dio='http://www.onvif.org/ver10/deviceIO/wsdl'
    xmlns:events='http://www.onvif.org/ver10/events/wsdl'
    xmlns:actions='http://updates.costarhd.com/ver1/riseactionengine/wsdl'
    xmlns:thermal='http://updates.costarhd.com/ver1/risethermal/wsdl'
    xmlns:advsecurity='http://www.onvif.org/ver10/advancedsecurity/wsdl'
    xmlns:extension='http://updates.costarhd.com/ver1/extension/wsdl'>
    <s:Header xmlns:s='http://www.w3.org/2003/05/soap-envelope'>
        <wsse:Security
            xmlns:wsse='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd'
            xmlns:wsu='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd'>
            <wsse:UsernameToken>
                <wsse:Username>admin</wsse:Username>
                <wsse:Password
                    Type='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest'>
                    T4O8jFrPtVGBeXCiF5dcwzMfrsQ=</wsse:Password>
                <wsse:Nonce>NDBjMWFhZGQtN2FmMy00Njk5LQ==</wsse:Nonce>
                <wsu:Created>2025-06-25T19:46:19.624Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </s:Header>
    <soap:Body>
        <ptz:ContinuousMove>
            <ptz:ProfileToken>Profile1</ptz:ProfileToken>
            <ptz:Velocity>
                <schema:PanTilt x='-0.66' y='0' />
            </ptz:Velocity>
        </ptz:ContinuousMove>
    </soap:Body>
</soap:Envelope>